ErpTest/src/DataProcessors/НастройкаОтраженияДокументовВРеглУчете/НастройкаОтраженияДокументовВРеглУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаОтраженияДокументовВРеглУчете</name>
</mdclass:DataProcessor>

ErpTest/src/InformationRegisters/ПорядокОтраженияРасходов/ПорядокОтраженияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокОтраженияРасходов</name>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеВУСН</name>
    <type>
      <types>EnumRef.ОтражениеВУСН</types>
    </type>
  </resources>
  <resources>
    <name>СпособНастройкиСчетовУчета</name>
    <type>
      <types>EnumRef.СпособыНастройкиСчетовУчета</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовНУ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконто</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконтоНУ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>СчетСписанияОСНО</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетСписанияЕНВД</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.СписаниеЗадолженности</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/DataProcessors/НастройкаОтраженияДокументовВРеглУчете/Forms/ФормаИндивидуальнойНастройкиСчетовРасходов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Организация = Параметры.Организация;
	Подразделение = Параметры.Подразделение;
	СтатьяРасходов = Параметры.СтатьяРасходов;
	Период.ДатаОкончания = Параметры.ДатаОкончания;
	
	ЗаполнитьТаблицуСчетовУчетаРасходов();
	
	Элементы.ФормаСохранитьНастройку.Доступность = Ложь;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ПоказыватьОтраженныеВУчете = Настройки.Получить("ПоказыватьОтраженныеВУчете");
	Если ПоказыватьОтраженныеВУчете Тогда
		ЗаполнитьТаблицуСчетовУчетаРасходов();
	КонецЕсли;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И ЗавершениеРаботы Тогда
		Отказ = Истина;
		ТекстПредупреждения = 
		НСтр("ru = 'Настройки счетов были изменены, но не сохранены. Для того, чтобы изменения вступили в силу следует сохранить настройку.'");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru = 'Настройки счетов были изменены. Сохранить изменения?'");
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ИзмененыНастройкиОтраженияВУчете И Не ЗавершениеРаботы Тогда
		Оповестить("ИзмененыНастройкиОтраженияВУчете");
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСчетаУчетаРасходов(Команда)
	
	ЗаполнитьТаблицуСчетовУчетаРасходов();
	
КонецПроцедуры // ОбновитьСчетаУчетаРасходов()

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	СохранитьСчетаУчетаРасходов();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // СохранитьНастройку()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодВариантПриИзменении(Элемент)
	
	ЗаполнитьТаблицуСчетовУчетаРасходов();
	
КонецПроцедуры // ПериодВариантПриИзменении()

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	
	ЗаполнитьТаблицуСчетовУчетаРасходов();
	
КонецПроцедуры // ПериодДатаНачалаПриИзменении()

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	
	ЗаполнитьТаблицуСчетовУчетаРасходов();
	
КонецПроцедуры // ПериодДатаОкончанияПриИзменении()

&НаКлиенте
Процедура ПоказыватьОтраженныеВУчетеПриИзменении(Элемент)
	
	ЗаполнитьТаблицуСчетовУчетаРасходов();
	
КонецПроцедуры // ПоказыватьОтраженныеВУчетеПриИзменении()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСчетаУчетаРасходов

&НаКлиенте
Процедура СчетаУчетаРасходовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элемент.ТекущиеДанные;
	Если Поле = Элементы.СчетаУчетаРасходовНомер
	 ИЛИ Поле = Элементы.СчетаУчетаРасходовДата
	 ИЛИ Поле = Элементы.СчетаУчетаРасходовТип Тогда
		ПоказатьЗначение(Неопределено, СтрокаТаблицы.Документ);
	КонецЕсли;
	
КонецПроцедуры // СчетаУчетаРасходовВыбор()

&НаКлиенте
Процедура СчетаУчетаРасходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтрокаТаблицы = Элемент.ТекущиеДанные;
	СтрокаТаблицы.ДанныеИзменены = Истина;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // СчетаУчетаРасходовПриОкончанииРедактирования()

&НаКлиенте
Процедура СчетаУчетаРасходовСчетУчетаПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.СчетаУчетаРасходов.ТекущиеДанные;
	СтрокаТаблицы.СчетУчетаНУ = СтрокаТаблицы.СчетУчета;
	
КонецПроцедуры // СчетаУчетаРасходовСчетУчетаПриИзменении()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет таблицу настройки счетов учета расходов.
//
&НаСервере
Процедура ЗаполнитьТаблицуСчетовУчетаРасходов()
	
	МассивОрганизаций = Новый Массив;
	МассивОрганизаций.Добавить(Организация);
	
	СчетаУчетаРасходов.Очистить();
	
	РезультатЗапроса = РегистрыСведений.ПорядокОтраженияРасходов.РезультатЗапросаПоНастройкамОтраженияВУчетеДетально(
		Организация,
		Подразделение,
		СтатьяРасходов,
		Период.ДатаНачала,
		Период.ДатаОкончания,
		ПоказыватьОтраженныеВУчете);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СчетаУчетаРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуСчетовУчетаРасходов()

// В процедуре выполняется установка свойств элементов формы.
//
&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ФормаСохранитьНастройку.Доступность = Модифицированность;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

// Процедура производит сохранение счетов учета расходов.
//
&НаСервере
Процедура СохранитьСчетаУчетаРасходов()
	
	МассивСтрок = СчетаУчетаРасходов.НайтиСтроки(Новый Структура("ДанныеИзменены", Истина));
	
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		
		СтрокаТаблицы.ДанныеИзменены = Ложь;
		
		МенеджерЗаписи = РегистрыСведений.ПорядокОтраженияРасходов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТаблицы);
		
		МенеджерЗаписи.Организация = Организация;
		МенеджерЗаписи.Подразделение = Подразделение;
		МенеджерЗаписи.СтатьяРасходов = СтатьяРасходов;
		МенеджерЗаписи.СпособНастройкиСчетовУчета = Неопределено;
		
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;
	
	Модифицированность = Ложь;
	
КонецПроцедуры // СохранитьСчетаУчетаРасходов()

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        СохранитьСчетаУчетаРасходов();
    КонецЕсли;

КонецПроцедуры // ПередЗакрытием()

#КонецОбласти
